# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-Ultimate-Combo: Maximum Performance dengan Strategi Berbeda
# 
# Strategi INOVATIF:
# - FBSBMS di backbone (precision boost) - Best Precision: 0.815
# - SOE di P3 neck (small object boost) - mAP50: 0.87
# - DPRB di P4 neck (recall boost) - Best Recall: 0.821
# - DeformableHead di P4 & P5 output (adaptive geometry) - mAP50: 0.872
# - SPDConv di semua downsampling (preserve small objects)
#
# Expected: mAP50 ~0.88-0.89, mAP50-95 ~0.45-0.46
# Strategi: Setiap modul di tempat yang paling efektif!

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone dengan FBSBMS untuk precision
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, FBSBMS, [512]] # 7-FBSBMS: Best Precision (0.815) di backbone P4
  
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]
  - [-1, 1, FBSBMS, [1024]] # 10-FBSBMS: Best Precision (0.815) di backbone P5

# YOLO12n head - Ultimate Combo dengan strategi berbeda
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4 (layer 7 = P4 setelah FBSBMS)
  - [-1, 2, A2C2f, [512, False, -1]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 16
  - [-1, 1, SOE, [256]] # 17-SOE: Small Object Enhancement (mAP50: 0.87) di P3

  # Bottom-up path (PAN) - Strategi berbeda
  - [-1, 1, SPDConv, [256, 3, 2]] # 18-SPDConv preserve small object info (P3->P4)
  - [[-1, 13], 1, Concat, [1]] # 19-cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 20
  - [-1, 1, DPRB, [512]] # 21-DPRB: Best Recall (0.821) di P4 neck
  - [-1, 1, DeformableHead, [512]] # 22-DeformableHead: Adaptive geometry di P4 output

  - [-1, 1, SPDConv, [512, 3, 2]] # 23-SPDConv untuk P4->P5
  - [[-1, 10], 1, Concat, [1]] # 24-cat head P5 (layer 10 = P5 setelah FBSBMS)
  - [-1, 2, C3k2, [1024, True]] # 25
  - [-1, 1, DeformableHead, [1024]] # 26-DeformableHead: Adaptive geometry di P5 output

  - [[17, 22, 26], 1, Detect, [nc]] # Detect(P3, P4, P5)



