# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-FBSB-Deformable: Optimal Combination
# 
# Strategy:
# - FBSB: Foreground-Background Separation (di P3 & P4 top-down)
# - DeformableHead: Adaptive geometric transformation (di P4 & P5 bottom-up)
# - Kombinasi ini memberikan mAP50 tinggi karena:
#   * FBSB meningkatkan precision dengan FG/BG separation
#   * DeformableHead meningkatkan recall dengan adaptive geometry
#
# Expected: mAP50 ~0.87-0.88, mAP50-95 ~0.44-0.45

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head - FBSB + DeformableHead Combination
head:
  # Top-down path (FPN) - FBSB untuk FG/BG separation
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, FBSB, [512]] # 12-FBSB: Foreground-Background Separation di P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15
  - [-1, 1, FBSB, [256]] # 16-FBSB: Foreground-Background Separation di P3

  # Bottom-up path (PAN) - DeformableHead untuk adaptive geometry
  - [-1, 1, Conv, [256, 3, 2]] # 17-Downsample P3 to P4 size
  - [[-1, 12], 1, Concat, [1]] # 18-cat head P4 (layer 12 = P4 setelah FBSB)
  - [-1, 2, A2C2f, [512, False, -1]] # 19
  - [-1, 1, DeformableHead, [512]] # 20-DeformableHead: Adaptive geometry di P4

  - [-1, 1, Conv, [512, 3, 2]] # 21-Downsample P4 to P5 size
  - [[-1, 8], 1, Concat, [1]] # 22-cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23
  - [-1, 1, DeformableHead, [1024]] # 24-DeformableHead: Adaptive geometry di P5

  - [[16, 20, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)



