# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-P3P5-Synergy: Synergistic dengan P3-P5 (P4 & P5 attention di backbone)
# 
# Strategi SINERGI:
# - Backbone: P4 & P5 punya attention (A2C2f True) → LEVERAGE attention ini
# - P3 Neck: FBSB → SOE → CBAM (sequential enhancement)
# - P4 Neck: FBSB → DPRB → DeformableHead (cascade boost)
# - P5 Neck: Leverage backbone attention → DeformableHead
# - SPDConv untuk preserve small objects
#
# Expected: mAP50 ~0.89-0.90, mAP50-95 ~0.46-0.47
# Focus: Modul bekerja sinergis, leverage P4 & P5 attention

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone - P4 & P5 punya attention (A2C2f dengan True)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 dengan attention (True) → LEVERAGE ini
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-P5 dengan attention (True) → LEVERAGE ini

# YOLO12n head - Synergy: Leverage backbone attention + sequential enhancement
head:
  # Top-down path (FPN) - Leverage P4 & P5 attention
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9-Upsample P5 (punya attention) ke P4 size
  - [[-1, 6], 1, Concat, [1]] # 10-cat backbone P4 (layer 6 = P4 dengan attention)
  - [-1, 2, A2C2f, [512, False, -1]] # 11-Refine dengan leverage P4 attention
  - [-1, 1, FBSB, [512]] # 12-FBSB: Precision boost setelah leverage attention

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13-Upsample ke P3 size
  - [[-1, 4], 1, Concat, [1]] # 14-cat backbone P3 (layer 4 = P3 backbone)
  - [-1, 2, A2C2f, [256, False, -1]] # 15-Refine P3 features
  # P3: Sequential enhancement (sinergis)
  - [-1, 1, FBSB, [256]] # 16-FBSB: FG/BG separation
  - [-1, 1, SOE, [256]] # 17-SOE: Small object enhancement
  - [-1, 1, CBAM, [256]] # 18-CBAM: Channel + Spatial attention (additional refinement)

  # Bottom-up path (PAN) - Cascade dengan leverage attention
  - [-1, 1, SPDConv, [256, 3, 2]] # 19-SPDConv preserve small objects (P3->P4)
  - [[-1, 12], 1, Concat, [1]] # 20-cat head P4 (layer 12 = P4 setelah FBSB)
  - [-1, 2, A2C2f, [512, False, -1]] # 21-Refine P4 PAN
  # P4: Cascade boost (sinergis)
  - [-1, 1, FBSB, [512]] # 22-FBSB: Precision
  - [-1, 1, DPRB, [512]] # 23-DPRB: Recall (dense refinement)
  - [-1, 1, DeformableHead, [512]] # 24-DeformableHead: Adaptive geometry

  - [-1, 1, SPDConv, [512, 3, 2]] # 25-SPDConv (P4->P5)
  - [[-1, 8], 1, Concat, [1]] # 26-cat head P5 (layer 8 = P5 dengan attention dari backbone)
  - [-1, 2, C3k2, [1024, True]] # 27-Refine P5 PAN (True = dengan attention)
  # P5: Leverage backbone attention + DeformableHead
  - [-1, 1, DeformableHead, [1024]] # 28-DeformableHead: Adaptive geometry untuk large objects

  - [[18, 24, 28], 1, Detect, [nc]] # Detect(P3, P4, P5) - Synergistic


