# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-FBSB-Deformable-Aggressive: Maximum Performance
# 
# Strategy:
# - FBSB di SEMUA layer (P3, P4, P5 top-down + P4, P5 bottom-up)
# - DeformableHead di SEMUA output layer (P3, P4, P5)
# - Kombinasi agresif untuk maximum mAP
#
# Expected: mAP50 ~0.88-0.89, mAP50-95 ~0.45-0.46
# Warning: Lebih berat, monitor memory usage!

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head - Aggressive: FBSB + DeformableHead di semua layer
head:
  # Top-down path (FPN) - FBSB di semua layer
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, FBSB, [512]] # 12-FBSB di P4 top-down

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15
  - [-1, 1, FBSB, [256]] # 16-FBSB di P3 top-down

  # Bottom-up path (PAN) - FBSB + DeformableHead di semua layer
  - [-1, 1, Conv, [256, 3, 2]] # 17-Downsample P3 to P4 size
  - [[-1, 12], 1, Concat, [1]] # 18-cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 19
  - [-1, 1, FBSB, [512]] # 20-FBSB di P4 bottom-up
  - [-1, 1, DeformableHead, [512]] # 21-DeformableHead di P4

  - [-1, 1, Conv, [512, 3, 2]] # 22-Downsample P4 to P5 size
  - [[-1, 8], 1, Concat, [1]] # 23-cat head P5
  - [-1, 2, C3k2, [1024, True]] # 24
  - [-1, 1, FBSB, [1024]] # 25-FBSB di P5 bottom-up
  - [-1, 1, DeformableHead, [1024]] # 26-DeformableHead di P5

  # DeformableHead juga di P3 output
  - [16, 1, DeformableHead, [256]] # 27-DeformableHead di P3 output

  - [[27, 21, 26], 1, Detect, [nc]] # Detect(P3, P4, P5)



