# YOLOv12s-Involution 🚀, AGPL-3.0 license
# YOLOv12 object detection model with Involution blocks for spatially-aware feature extraction
# Involution replaces traditional convolution layers to refine spatially relevant feature extraction
# Unlike fixed convolution filters (spatial-agnostic), involution uses dynamic, spatially specific filters
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12s-involution.yaml' will call yolov12s-involution.yaml with scale 's'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone with Involution blocks
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Involution, [256, 7]] # 2-Involution: Spatial refinement at P2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Involution, [512, 7]] # 4-Involution: Spatial refinement at P3
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Involution, [512, 5]] # 6-Involution: Spatial refinement at P4
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head with Involution blocks
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9-Upsample P5 (layer 8/backbone last) to P4 size
  - [[-1, 8], 1, Concat, [1]] # 10-cat backbone P4 (layer 8 = A2C2f with 512ch)
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, Involution, [512, 7]] # 12-Involution: Spatial refinement in neck P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13-Upsample P4 neck to P3 size
  - [[-1, 5], 1, Concat, [1]] # 14-cat backbone P3 (layer 5 = C3k2)
  - [-1, 2, A2C2f, [256, False, -1]] # 15
  - [-1, 1, Involution, [256, 7]] # 16-Involution: Spatial refinement in neck P3 (critical for small objects)

  - [-1, 1, Conv, [256, 3, 2]] # 17-Downsample P3 neck to P4 size
  - [[-1, 12], 1, Concat, [1]] # 18-cat head P4 (layer 12 = Involution from P4 neck)
  - [-1, 2, A2C2f, [512, False, -1]] # 19

  - [-1, 1, Conv, [512, 3, 2]] # 20-Downsample P4 neck to P5 size
  - [[-1, 11], 1, Concat, [1]] # 21-cat head P5 (layer 11 = A2C2f from backbone P5)
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

