# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-SFAN-Simple: Versi Simple (NSB + SOEH saja, skip AFF)
# 
# Alternative simple version untuk implementasi cepat (2-3 jam)
# Expected: +0.5-1% improvement, lebih cepat dari full SFAN
#
# Solusi SFAN-Simple:
# 1. NoiseSuppressionBlock (NSB): Suppress noise di P4 & P5 output
# 2. SmallObjectEnhancementHead (SOEH): Head khusus untuk small object detection
# 3. Skip AFF, pakai Concat biasa (lebih simple)

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 output
  - [-1, 1, NoiseSuppression, [512, 4]] # 7-NSB: Suppress noise di P4 (ratio=4)
  
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 9-P5 output
  - [-1, 1, NoiseSuppression, [1024, 4]] # 10-NSB: Suppress noise di P5 (ratio=4)

# YOLOv12-SFAN-Simple head (P4-P5 only)
head:
  # Top-down path (FPN) - pakai Concat biasa (lebih simple dari AFF)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11-Upsample P5 to P4 size
  - [[-1, 7], 1, Concat, [1]] # 12-Concat P5_upsampled (layer 11) + P4_NSB (layer 7)
  - [-1, 2, A2C2f, [512, False, -1]] # 13-P4 neck output
  
  # Bottom-up path (PAN)
  - [-1, 1, Conv, [512, 3, 2]] # 14-Downsample P4 neck ke P5 size
  - [[-1, 10], 1, Concat, [1]] # 15-Concat P4_neck_downsampled (layer 14) + P5_NSB (layer 10)
  - [-1, 2, C3k2, [1024, True]] # 16-P5 neck output
  
  # Detection Heads dengan SmallObjectEnhancementHead (SOEH)
  - [[13, 16], 1, SmallObjectEnhancementHead, [nc]] # 17-SOEH: Detect(P4, P5)

