# YOLOv12-ECA 🚀, AGPL-3.0 license
# YOLOv12 object detection model with ECA (Efficient Channel Attention) Block
# ECA: Lightweight channel attention with adaptive kernel size
# Better than SE for small models with minimal parameters
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n-eca.yaml' will call yolov12-eca.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone with ECA
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, ECA,   [256]] # 3 ECA: Efficient Channel Attention di P2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 4-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 5
  - [-1, 1, ECA,   [512]] # 6 ECA: Efficient Channel Attention di P3
  - [-1, 1, Conv,  [512, 3, 2]] # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 8
  - [-1, 1, ECA,   [512]] # 9 ECA: Efficient Channel Attention di P4
  - [-1, 1, Conv,  [1024, 3, 2]] # 10-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 11
  - [-1, 1, ECA,   [1024]] # 12 ECA: Efficient Channel Attention di P5

# YOLO12-turbo head with ECA
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 8], 1, Concat, [1]] # 14 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 15
  - [-1, 1, ECA,   [512]] # 16 ECA: Efficient Channel Attention di P4 neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 5], 1, Concat, [1]] # 18 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 19
  - [-1, 1, ECA,   [256]] # 20 ECA: Efficient Channel Attention di P3 neck

  - [-1, 1, Conv, [256, 3, 2]] # 21
  - [[-1, 15], 1, Concat, [1]] # 22 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 23
  - [-1, 1, ECA,   [512]] # 24 ECA: Efficient Channel Attention di P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]] # 25
  - [[-1, 11], 1, Concat, [1]] # 26 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 27 (P5/32-large)
  - [-1, 1, ECA,   [1024]] # 28 ECA: Efficient Channel Attention di P5 bottom-up

  - [[19, 23, 27], 1, Detect, [nc]] # Detect(P3, P4, P5)



