# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P2-P4 outputs optimized for small object detection (BTA/AFB)
# Enhanced with RFCBAM (SOD-YOLO) and DySample for better small object detection

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 497 layers, 2,553,904 parameters, 2,553,888 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 533 layers, 19,670,784 parameters, 19,670,768 gradients, 60.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 895 layers, 26,506,496 parameters, 26,506,480 gradients, 83.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 895 layers, 59,414,176 parameters, 59,414,160 gradients, 185.9 GFLOPs


# YOLO12-turbo backbone with RFCBAM for downsampling (SOD-YOLO)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, RFCBAM,  [128, 3, 2]] # 1-P2/4 RFCBAM untuk preserve spatial info saat downsample
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, RFCBAM,  [256, 3, 2]] # 3-P3/8 RFCBAM untuk preserve spatial info
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, RFCBAM,  [512, 3, 2]] # 5-P4/16 RFCBAM untuk preserve spatial info
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, RFCBAM,  [1024, 3, 2]] # 7-P5/32 RFCBAM untuk preserve spatial info
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head with SmallObjectBlock, DySample, and RFCBAM for BTA/AFB detection
head:
  # ========= Top-down FPN: P5 -> P4 =========
  - [-1, 1, DySample, [512, 2]] # 9 DySample untuk dynamic upsampling
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, SmallObjectBlock, [512, 7]] # 12 SmallObjectBlock untuk P4 (BTA/AFB)

  # ========= Top-down FPN: P4 -> P3 =========
  - [-1, 1, DySample, [256, 2]] # 13 DySample untuk dynamic upsampling
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15
  - [-1, 1, SmallObjectBlock, [256, 7]] # 16 SmallObjectBlock untuk P3 (BTA/AFB)

  # ========= Top-down FPN: P3 -> P2 =========
  - [-1, 1, DySample, [128, 2]] # 17 DySample untuk dynamic upsampling
  - [[-1, 1], 1, Concat, [1]] # 18 cat backbone P2
  - [-1, 1, Conv, [128, 1, 1]] # 19 Pointwise conv untuk preliminary screening (BSSI-FPN)
  - [-1, 2, A2C2f, [128, False, -1]] # 20
  - [-1, 1, SmallObjectBlock, [128, 7]] # 21 SmallObjectBlock untuk P2 (BTA/AFB) - small objects

  # ========= Bottom-up PAN: P2 -> P3 =========
  - [-1, 1, RFCBAM, [128, 3, 2]] # 22 RFCBAM untuk preserve spatial info saat downsample
  - [[-1, 15], 1, Concat, [1]] # 23 cat head P3 (layer 15 adalah P3 head)
  - [-1, 2, A2C2f, [256, False, -1]] # 24
  - [-1, 1, SmallObjectBlock, [256, 7]] # 25 SmallObjectBlock untuk P3 pan (BTA/AFB)

  # ========= Bottom-up PAN: P3 -> P4 =========
  - [-1, 1, RFCBAM, [256, 3, 2]] # 26 RFCBAM untuk preserve spatial info
  - [[-1, 11], 1, Concat, [1]] # 27 cat head P4 (layer 11 adalah P4 head)
  - [-1, 2, C3k2, [512, False]] # 28
  - [-1, 1, SmallObjectBlock, [512, 7]] # 29 SmallObjectBlock untuk P4 pan (BTA/AFB)

  # ✅ Detect(P2, P3, P4) - optimized for small objects
  - [[21, 25, 29], 1, Detect, [nc]] # Detect(P2, P3, P4)
