# YOLOv12-Attention 🚀, AGPL-3.0 license
# YOLOv12 with Strategic Attention in Head/Neck (Backbone tetap kuat, tidak diubah)
# Optimized for BTA dataset (1265 images) - Attention hanya di head/neck untuk prevent overfitting
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone (Keep Strong - No Changes)
# Backbone sudah kuat, tidak perlu diotak-atik
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 2]]
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, False, 1]] # 8

# YOLO12-turbo head with Strategic Attention
# Strategy: Fokus attention di HEAD/Neck saja (backbone tetap kuat, tidak diubah)
# Attention di critical points: P3 untuk small objects, P4 untuk fusion
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10: cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, ChannelAttention, [512]] # 12: CA after P4 fusion (lightweight)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 3], 1, Concat, [1]] # 14: cat backbone P3 (layer 3)
  - [-1, 2, A2C2f, [256, False, -1]] # 15: Head P3 output
  - [-1, 1, CBAM, [7]] # 16: CBAM for P3 (critical for small objects - channel + spatial), args[0] = kernel_size

  - [-1, 1, Conv, [256, 3, 2]] # 17: Downsampling in neck
  - [[-1, 12], 1, Concat, [1]] # 18: cat head P4 (layer 12 after CA)
  - [-1, 2, A2C2f, [512, False, -1]] # 19
  - [-1, 1, SpatialAttention, [7]] # 20: SA for P4 head (spatial refinement)

  - [-1, 1, Conv, [512, 3, 2]] # 21: Downsampling in neck
  - [[-1, 8], 1, Concat, [1]] # 22: cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  - [[16, 19, 23], 1, Detect, [nc]] # 24: Detect(P3, P4, P5)

