# YOLOv12-P3-RPP 🚀, AGPL-3.0 license
# YOLOv12 with Resolution-Preserved Path (RPP) for P3 enhancement
# Direct connection from P2 backbone to P3 detection for higher resolution info
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head with RPP Block
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14
  
  # RPP Block: Resolution-Preserved Path (P3_neck=14/head, P2_backbone=2/backbone, output=256)
  - [[14, 2], 1, RPP, [256]] # 15 RPP: Direct connection from P2 to P3
  - [-1, 2, A2C2f, [256, False, -1]] # 16

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 11], 1, Concat, [1]] # 18 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 19

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 8], 1, Concat, [1]] # 21 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

