# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-Triple-Threat: 3 Modul Terbaik di Setiap Layer
# 
# Strategi: Setiap output layer (P3, P4, P5) punya 3 modul terbaik:
# - FBSB: mAP50-95 = 0.444 (TERBAIK)
# - SOE: mAP50 = 0.87 (bagus untuk small objects)
# - DeformableHead: mAP50 = 0.872 (adaptive geometry)
#
# Expected: mAP50 ~0.89-0.90, mAP50-95 ~0.46-0.47
# Warning: Sangat agresif, monitor memory!

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head - Triple Threat: FBSB + SOE + DeformableHead di setiap output
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14
  # P3: Triple Threat
  - [-1, 1, FBSB, [256]] # 15-FBSB: mAP50-95 = 0.444
  - [-1, 1, SOE, [256]] # 16-SOE: mAP50 = 0.87
  - [-1, 1, DeformableHead, [256]] # 17-DeformableHead: mAP50 = 0.872

  # Bottom-up path (PAN)
  - [-1, 1, SPDConv, [256, 3, 2]] # 18-SPDConv preserve small object info (P3->P4)
  - [[-1, 11], 1, Concat, [1]] # 19-cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 20
  # P4: Triple Threat
  - [-1, 1, FBSB, [512]] # 21-FBSB: mAP50-95 = 0.444
  - [-1, 1, SOE, [512]] # 22-SOE: mAP50 = 0.87
  - [-1, 1, DeformableHead, [512]] # 23-DeformableHead: mAP50 = 0.872

  - [-1, 1, SPDConv, [512, 3, 2]] # 24-SPDConv untuk P4->P5
  - [[-1, 8], 1, Concat, [1]] # 25-cat head P5
  - [-1, 2, C3k2, [1024, True]] # 26
  # P5: Triple Threat
  - [-1, 1, FBSB, [1024]] # 27-FBSB: mAP50-95 = 0.444
  - [-1, 1, SOE, [1024]] # 28-SOE: mAP50 = 0.87
  - [-1, 1, DeformableHead, [1024]] # 29-DeformableHead: mAP50 = 0.872

  - [[17, 23, 29], 1, Detect, [nc]] # Detect(P3, P4, P5)



