# YOLOv12-ASSN-ECA-Combo 🚀, AGPL-3.0 license
# YOLOv12 dengan kombinasi ASSN + ECA untuk improve mAP
# Strategi: ASSN untuk attention-based fusion + ECA untuk lightweight refinement
# Hati-hati OOM: Menggunakan teknik lightweight, focus di neck
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone (clean, no attention untuk avoid OOM)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head dengan ASSN + ECA combo
head:
  # Top-down path: P5 → P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11 P4 processed
  - [-1, 1, ECA,   [512]] # 12 ECA: Lightweight attention di P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15 P3A processed
  - [-1, 1, ECA,   [256]] # 16 ECA: Lightweight attention di P3A

  # ASSN: Attention-based Scale Sequence Network
  # Takes [P5, P4, P3A] dan menghasilkan refined P3B dengan attention
  - [[8, 11, 15], 1, ASSN, [1024, 512, 256, 256]] # 17 ASSN: P3B refined (menggunakan P5, P4, P3A)
  - [-1, 1, ECA,   [256]] # 18 ECA: Final refinement di P3B

  # Bottom-up path: P3 → P4 → P5
  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 11], 1, Concat, [1]] # 20 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 21 P4 bottom-up
  - [-1, 1, ECA,   [512]] # 22 ECA: Attention refinement di P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 8], 1, Concat, [1]] # 24 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 25 P5 bottom-up
  - [-1, 1, ECA,   [1024]] # 26 ECA: Attention refinement di P5 bottom-up

  # Final outputs dengan ECA refinement sebelum Detect
  - [17, 1, ECA,   [256]] # 27 P3 final dengan ECA
  - [21, 1, ECA,   [512]] # 28 P4 final dengan ECA  
  - [25, 1, ECA,   [1024]] # 29 P5 final dengan ECA

  - [[27, 28, 29], 1, Detect, [nc]] # Detect(P3, P4, P5) dengan ASSN+ECA-enhanced features

