# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-P3P5-Optimal: Maximum mAP dengan P3-P5 (P4 & P5 punya attention di backbone)
# 
# Strategi OPTIMAL:
# - Backbone: P4 & P5 punya A2C2f dengan attention (True) → TIDAK BOLEH DIUBAH
# - P3 Neck: FBSB + SOE (small objects + precision)
# - P4 Neck: DPRB (recall boost) + DeformableHead (adaptive)
# - P5 Neck: DeformableHead (adaptive geometry)
# - SPDConv di semua downsampling (preserve small objects)
#
# Expected: mAP50 ~0.89-0.90, mAP50-95 ~0.46-0.47
# Focus: Leverage P4 & P5 attention + strengthen P3 neck

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone - P4 & P5 punya attention (A2C2f dengan True)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 dengan attention (True) → JANGAN UBAH
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-P5 dengan attention (True) → JANGAN UBAH

# YOLO12n head - Optimal untuk P3-P5 dengan strategi berbeda
head:
  # Top-down path (FPN) - Leverage P4 & P5 attention dari backbone
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9-Upsample P5 ke P4 size
  - [[-1, 6], 1, Concat, [1]] # 10-cat backbone P4 (layer 6 = P4 dengan attention)
  - [-1, 2, A2C2f, [512, False, -1]] # 11-Refine fused P4 features
  - [-1, 1, FBSB, [512]] # 12-FBSB: mAP50-95 = 0.444 (precision boost) di P4 neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13-Upsample P4 neck ke P3 size
  - [[-1, 4], 1, Concat, [1]] # 14-cat backbone P3 (layer 4 = P3 backbone output)
  - [-1, 2, A2C2f, [256, False, -1]] # 15-Refine fused P3 features
  # P3: Triple boost untuk small objects
  - [-1, 1, FBSB, [256]] # 16-FBSB: mAP50-95 = 0.444 (precision) di P3 neck
  - [-1, 1, SOE, [256]] # 17-SOE: mAP50 = 0.87 (small object enhancement) di P3 neck

  # Bottom-up path (PAN) - Optimize fusion dengan P4 & P5 yang punya attention
  - [-1, 1, SPDConv, [256, 3, 2]] # 18-SPDConv preserve small objects (P3->P4)
  - [[-1, 12], 1, Concat, [1]] # 19-cat head P4 (layer 12 = P4 setelah FBSB)
  - [-1, 2, A2C2f, [512, False, -1]] # 20-Refine P4 PAN features
  # P4: Recall + Adaptive geometry
  - [-1, 1, DPRB, [512]] # 21-DPRB: Recall = 0.821 (recall boost) di P4 neck
  - [-1, 1, DeformableHead, [512]] # 22-DeformableHead: mAP50 = 0.872 (adaptive geometry) di P4 output

  - [-1, 1, SPDConv, [512, 3, 2]] # 23-SPDConv preserve small objects (P4->P5)
  - [[-1, 8], 1, Concat, [1]] # 24-cat head P5 (layer 8 = P5 dengan attention dari backbone)
  - [-1, 2, C3k2, [1024, True]] # 25-Refine P5 PAN features (True = dengan attention)
  # P5: Adaptive geometry untuk large objects
  - [-1, 1, DeformableHead, [1024]] # 26-DeformableHead: mAP50 = 0.872 (adaptive geometry) di P5 output

  - [[17, 22, 26], 1, Detect, [nc]] # Detect(P3, P4, P5) - Semua punya enhancement


