# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-P3P5-Balanced: Balanced Performance dengan P3-P5
# 
# Strategi BALANCED:
# - Backbone: P4 & P5 punya attention → TIDAK DIUBAH
# - P3 Neck: FBSBMS (precision) + SOE (small objects)
# - P4 Neck: FBSB (mAP) + DeformableHead (adaptive)
# - P5 Neck: DeformableHead (adaptive)
# - SPDConv di downsampling
#
# Expected: mAP50 ~0.88-0.89, mAP50-95 ~0.45-0.46
# Focus: Balance precision + recall + small objects

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone - P4 & P5 punya attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 dengan attention → JANGAN UBAH
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-P5 dengan attention → JANGAN UBAH

# YOLO12n head - Balanced untuk P3-P5
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4 (dengan attention)
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, FBSB, [512]] # 12-FBSB di P4 neck (mAP50-95 = 0.444)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15
  # P3: Precision + Small objects
  - [-1, 1, FBSBMS, [256]] # 16-FBSBMS: Precision = 0.815 (multi-scale mask)
  - [-1, 1, SOE, [256]] # 17-SOE: mAP50 = 0.87 (small object enhancement)

  # Bottom-up path (PAN)
  - [-1, 1, SPDConv, [256, 3, 2]] # 18-SPDConv (P3->P4)
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 20
  - [-1, 1, DeformableHead, [512]] # 21-DeformableHead: mAP50 = 0.872 (adaptive geometry)

  - [-1, 1, SPDConv, [512, 3, 2]] # 22-SPDConv (P4->P5)
  - [[-1, 8], 1, Concat, [1]] # cat head P5 (dengan attention)
  - [-1, 2, C3k2, [1024, True]] # 24
  - [-1, 1, DeformableHead, [1024]] # 25-DeformableHead: mAP50 = 0.872 (adaptive geometry)

  - [[17, 21, 25], 1, Detect, [nc]] # Detect(P3, P4, P5) - Balanced


