# YOLOv12 Hybrid 🚀, AGPL-3.0 license
# Hybrid version: Kombinasi best practices tanpa GSConv/CBAM
# - ChannelAttention + SpatialAttention (separate, bukan CBAM)
# - SPDConv untuk small object detection
# - BConcat untuk better feature fusion
# - SPPF untuk multi-scale features
# - Optimized untuk maximum mAP

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9 - Multi-scale features

# YOLO12-turbo head (Hybrid: CA/SA + SPDConv + BConcat)
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 12
  - [-1, 1, ChannelAttention, [512]] # 13 - CA
  - [-1, 1, SpatialAttention, [7]] # 14 - SA

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 17
  - [-1, 1, ChannelAttention, [256]] # 18 - CA
  - [-1, 1, SpatialAttention, [7]] # 19 - SA

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [[-1, 1], 1, Concat, [1]] # 21 cat backbone P2
  - [-1, 1, BConcat, [128]] # 22 - BConcat untuk better fusion
  - [-1, 1, ChannelAttention, [128]] # 23 - CA untuk P2 (small objects)
  - [-1, 1, SpatialAttention, [7]] # 24 - SA untuk P2

  # Bottom-up path (PAN) - SPDConv untuk small object preservation
  - [-1, 1, SPDConv, [128, 3, 2]] # 25 - SPDConv preserve small object info
  - [[-1, 19], 1, Concat, [1]] # 26 cat head P3
  - [-1, 1, BConcat, [256]] # 27 - BConcat fusion
  - [-1, 1, ChannelAttention, [256]] # 28 - CA
  - [-1, 1, SpatialAttention, [7]] # 29 - SA

  - [-1, 1, SPDConv, [256, 3, 2]] # 30 - SPDConv downsample
  - [[-1, 14], 1, Concat, [1]] # 31 cat head P4
  - [-1, 2, C3k2, [512, False]] # 32
  - [-1, 1, ChannelAttention, [512]] # 33 - CA
  - [-1, 1, SpatialAttention, [7]] # 34 - SA

  # Detect
  - [[24, 29, 34], 1, Detect, [nc]] # 35 Detect(P2, P3, P4)

