# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-SFAN-Workaround: Versi Temporary menggunakan modul existing
# 
# ⚠️ CATATAN: Versi ini menggunakan modul yang SUDAH ADA sebagai placeholder
# Untuk versi full SFAN, perlu implement modul baru:
# - NoiseSuppression → Pakai ChannelAttention + SpatialAttention (CBAM-like)
# - AdaptiveFeatureFusion → Pakai Concat biasa (temporary)
# - SmallObjectEnhancementHead → Pakai Detect biasa (temporary)
#
# Versi ini bisa di-parse dan di-train, tapi belum full SFAN functionality.
# Setelah implement modul baru, ganti ke yolov12-sfan.yaml

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 output
  # Workaround NSB: Pakai ChannelAttention + SpatialAttention (CBAM-like)
  - [-1, 1, ChannelAttention, [512]] # 7-Channel attention (noise suppression)
  - [-1, 1, SpatialAttention, [7]] # 8-Spatial attention (noise suppression)
  
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10-P5 output
  # Workaround NSB: Pakai ChannelAttention + SpatialAttention
  - [-1, 1, ChannelAttention, [1024]] # 11-Channel attention (noise suppression)
  - [-1, 1, SpatialAttention, [7]] # 12-Spatial attention (noise suppression)

# YOLOv12-SFAN-Workaround head (P4-P5 only)
head:
  # Top-down path (FPN) - Workaround AFF: Pakai Concat biasa
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13-Upsample P5 to P4 size
  - [[-1, 8], 1, Concat, [1]] # 14-Concat P5_upsampled (layer 13) + P4_NSB (layer 8)
  - [-1, 2, A2C2f, [512, False, -1]] # 15-P4 neck output
  - [-1, 1, SOE, [512]] # 16-SOE: Small Object Enhancement (workaround SOEH)
  
  # Bottom-up path (PAN)
  - [-1, 1, Conv, [512, 3, 2]] # 17-Downsample P4 neck ke P5 size
  - [[-1, 12], 1, Concat, [1]] # 18-Concat P4_neck_downsampled (layer 17) + P5_NSB (layer 12)
  - [-1, 2, C3k2, [1024, True]] # 19-P5 neck output
  - [-1, 1, SOE, [1024]] # 20-SOE: Small Object Enhancement (workaround SOEH)
  
  # Detection Heads - Workaround SOEH: Pakai Detect biasa
  - [[16, 20], 1, Detect, [nc]] # 21-Detect(P4, P5)

