# Ultralytics 🚀 AGPL-3.0 License

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ================= BACKBONE =================
backbone:
  - [-1, 1, SPDConv, [64, 3, 2]]              # 0 P1/2
  - [-1, 1, SPDConv, [128, 3, 2]]             # 1 P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]         # 2 P2
  - [-1, 1, SPDConv, [256, 3, 2]]             # 3 P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]         # 4 P3
  - [-1, 1, SPDConv, [512, 3, 2]]             # 5 P4/16
  - [-1, 4, A2C2f, [512, True, 4]]            # 6 P4
  - [-1, 1, SPDConv, [1024, 3, 2]]            # 7 P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]           # 8 P5

# ================= HEAD (FPN ONLY) =================
head:
  # -------- FPN Top-down: P5 -> P4 -> P3 -> P2 --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]        # 9  P5 -> P4
  - [[-1, 6], 1, Concat, [1]]                         # 10 cat backbone P4 (6)
  - [-1, 2, A2C2f, [512, False, -1]]                  # 11 P4_head

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]        # 12 P4 -> P3
  - [[-1, 4], 1, Concat, [1]]                         # 13 cat backbone P3 (4)
  - [-1, 2, A2C2f, [256, False, -1]]                  # 14 P3_head

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]        # 15 P3 -> P2
  - [[-1, 2], 1, Concat, [1]]                         # 16 cat backbone P2 (2)
  - [-1, 2, A2C2f, [256, False, -1]]                  # 17 P2_out

  # -------- Detect: use FPN outputs + backbone P5 --------
  - [[17, 14, 11, 8], 1, Detect, [nc]]                # Detect(P2, P3, P4, P5)
