# YOLOv12-P3-SADHead 🚀, AGPL-3.0 license
# YOLOv12 dengan Scale-Aware Dynamic NMS Head (SAD-Head) untuk P3
# Novelty: tiny-object prior integrated into detection head for bacilli-scale bounding boxes
# Note: SAD-Head requires custom Detect head modification - this is a placeholder config
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n-p3-sadhead.yaml' will call yolov12-p3-sadhead.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head with SAD-Head for P3
# Note: SAD-Head needs to be integrated into Detect head's forward pass
# This config shows where to apply SAD-Head preprocessing
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14
  - [-1, 1, SADHead, [256]] # 15 SAD-Head: Scale-Aware Dynamic Head untuk P3 (penalty untuk box besar)
  # Note: SAD-Head returns (features, penalty) - needs custom Detect integration

  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 11], 1, Concat, [1]] # 17 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 18

  - [-1, 1, Conv, [512, 3, 2]] # 19
  - [[-1, 8], 1, Concat, [1]] # 20 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 21 (P5/32-large)

  - [[14, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
  # TODO: Modify Detect head to use SAD-Head penalty for P3 cls logits






























