# YOLOv12-P3P4-CrossAttn 🚀, AGPL-3.0 license
# YOLOv12 dengan Cross-Scale Attention: P3 dan P4 saling attention
# P3 dan P4 saling reference untuk enhance features
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head with Cross-Scale Attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, CoordinateAttention, [512]] # 12 CoordAttn di P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15
  - [-1, 1, CoordinateAttention, [256]] # 16 CoordAttn di P3
  
  # Cross-scale: P3 dan P4 saling enhance
  # P4 → P3: Downsample P4 attention ke P3
  # P3 → P4: Upsample P3 attention ke P4 (via residual di P4)
  - [-1, 1, SimAM, [256]] # 17 SimAM: Additional attention di P3
  - [-1, 2, A2C2f, [256, False, -1]] # 18

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 20
  - [-1, 1, SimAM, [512]] # 21 SimAM: Additional attention di P4

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  - [[18, 21, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)

