# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-P3P5-Aggressive: Maximum Aggressive dengan P3-P5
# 
# Strategi AGRESSIF:
# - Backbone: P4 & P5 punya A2C2f dengan attention → TIDAK DIUBAH
# - P3 Neck: FBSB + SOE + DeformableHead (triple boost)
# - P4 Neck: FBSB + DPRB + DeformableHead (triple boost)
# - P5 Neck: DeformableHead (adaptive)
# - SPDConv di semua downsampling
#
# Expected: mAP50 ~0.90-0.91, mAP50-95 ~0.47-0.48
# Warning: Sangat agresif, monitor memory!

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone - P4 & P5 punya attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 dengan attention → JANGAN UBAH
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-P5 dengan attention → JANGAN UBAH

# YOLO12n head - Aggressive untuk P3-P5
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4 (dengan attention)
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, FBSB, [512]] # 12-FBSB di P4 neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15
  # P3: Triple Threat - Maximum boost untuk small objects
  - [-1, 1, FBSB, [256]] # 16-FBSB: mAP50-95 = 0.444
  - [-1, 1, SOE, [256]] # 17-SOE: mAP50 = 0.87
  - [-1, 1, DeformableHead, [256]] # 18-DeformableHead: mAP50 = 0.872

  # Bottom-up path (PAN)
  - [-1, 1, SPDConv, [256, 3, 2]] # 19-SPDConv (P3->P4)
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 21
  # P4: Triple Threat - Maximum boost
  - [-1, 1, FBSB, [512]] # 22-FBSB: mAP50-95 = 0.444
  - [-1, 1, DPRB, [512]] # 23-DPRB: Recall = 0.821
  - [-1, 1, DeformableHead, [512]] # 24-DeformableHead: mAP50 = 0.872

  - [-1, 1, SPDConv, [512, 3, 2]] # 25-SPDConv (P4->P5)
  - [[-1, 8], 1, Concat, [1]] # cat head P5 (dengan attention)
  - [-1, 2, C3k2, [1024, True]] # 27
  # P5: DeformableHead untuk adaptive geometry
  - [-1, 1, DeformableHead, [1024]] # 28-DeformableHead: mAP50 = 0.872

  - [[18, 24, 28], 1, Detect, [nc]] # Detect(P3, P4, P5) - Semua aggressive


