# YOLOv12-BTA-Combo 🚀, AGPL-3.0 license
# YOLOv12 combo for BTA (Bacteria) detection: EdgePrior + LCM + TOA + AntiFP
# Combines all small object detection enhancements
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone with Edge-Prior + LCM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 1, EdgePriorBlock, [128]] # 2 Edge-Prior: High-frequency enhancement
  - [-1, 2, C3k2,  [256, False, 0.25]] # 3
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 4-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 5
  - [-1, 1, LocalContextMixer, [512]] # 6 LCM: Multi-dilated local context
  - [-1, 1, Conv,  [512, 3, 2]] # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 8
  - [-1, 1, Conv,  [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10

# YOLO12-turbo head with TOA + AntiFP
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [-1, 1, TinyObjectAlignment, [512]] # 12 TOA: Align before concat P4
  - [[-1, 8], 1, Concat, [1]] # 13 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [-1, 1, TinyObjectAlignment, [256]] # 16 TOA: Align before concat P3
  - [[-1, 6], 1, Concat, [1]] # 17 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 18
  - [-1, 1, AntiFPGate, [256]] # 19 Anti-FP Gate: Suppress noise

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 14], 1, Concat, [1]] # 21 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 22
  - [-1, 1, AntiFPGate, [512]] # 23 Anti-FP Gate: Suppress noise

  - [-1, 1, Conv, [512, 3, 2]] # 24
  - [[-1, 10], 1, Concat, [1]] # 25 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 26 (P5/32-large)
  - [-1, 1, AntiFPGate, [1024]] # 27 Anti-FP Gate: Suppress noise

  - [[19, 23, 27], 1, Detect, [nc]] # Detect(P3, P4, P5)

