# Ultralytics ðŸš€ AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-SFAN-Aggressive: Maximum Aggressive dengan Semua Top Performers
# 
# âš ï¸ WARNING: Versi ini AGRESSIF - pakai banyak modul proven, bisa lebih berat tapi expected maximum mAP
# 
# Kombinasi AGRESSIF:
# - FBSB: mAP50-95 = 0.444 (TERBAIK) - di semua P output
# - SOE: mAP50 = 0.87, mAP50-95 = 0.437 - di P3, P4
# - DeformableHead: mAP50 = 0.872, mAP50-95 = 0.44 - di P4, P5
# - SPDConv: Preserve small object info - di semua downsampling
# - ChannelAttention + SpatialAttention: Additional refinement
#
# Expected: Maximum mAP50-95 ~0.45-0.46 (jika semua modul bekerja optimal)

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 output
  # Aggressive noise suppression: FBSB + Attention
  - [-1, 1, FBSB, [512]] # 7-FBSB: Best mAP50-95 (0.444)
  - [-1, 1, ChannelAttention, [512]] # 8-Additional refinement
  - [-1, 1, SpatialAttention, [7]] # 9-Additional refinement
  
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 11-P5 output
  # Aggressive noise suppression: FBSB + Attention
  - [-1, 1, FBSB, [1024]] # 12-FBSB: Best mAP50-95 (0.444)
  - [-1, 1, ChannelAttention, [1024]] # 13-Additional refinement
  - [-1, 1, SpatialAttention, [7]] # 14-Additional refinement

# YOLOv12-SFAN-Aggressive head
head:
  # Top-down path (FPN) - dengan SOE untuk small objects
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15-Upsample P5 to P4 size
  - [[-1, 9], 1, Concat, [1]] # 16-Concat P5_upsampled (layer 15) + P4_refined (layer 9)
  - [-1, 2, A2C2f, [512, False, -1]] # 17-P4 neck output
  - [-1, 1, SOE, [512]] # 18-SOE: Small object enhancement (mAP50: 0.87)
  - [-1, 1, FBSB, [512]] # 19-FBSB: Additional refinement
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20-Upsample to P3 size
  - [[-1, 4], 1, Concat, [1]] # 21-Concat dengan backbone P3 (layer 4)
  - [-1, 2, A2C2f, [256, False, -1]] # 22-P3 neck output
  - [-1, 1, SOE, [256]] # 23-SOE: Small object enhancement
  - [-1, 1, FBSB, [256]] # 24-FBSB: Best mAP50-95 (0.444) untuk P3
  
  # Bottom-up path (PAN) - SPDConv untuk preserve small objects
  - [-1, 1, SPDConv, [256, 3, 2]] # 25-SPDConv: Preserve small object info (P3->P4)
  - [[-1, 19], 1, Concat, [1]] # 26-Concat P3_downsampled (layer 25) + P4_FBSB (layer 19)
  - [-1, 2, A2C2f, [512, False, -1]] # 27-P4 final output
  - [-1, 1, DeformableHead, [512]] # 28-DeformableHead: mAP50 = 0.872, mAP50-95 = 0.44
  
  - [-1, 1, SPDConv, [512, 3, 2]] # 29-SPDConv: Preserve small object info (P4->P5)
  - [[-1, 14], 1, Concat, [1]] # 30-Concat P4_downsampled (layer 29) + P5_refined (layer 14)
  - [-1, 2, C3k2, [1024, True]] # 31-P5 final output
  - [-1, 1, DeformableHead, [1024]] # 32-DeformableHead: mAP50 = 0.872, mAP50-95 = 0.44
  
  # Detection Heads
  - [[24, 28, 32], 1, Detect, [nc]] # 33-Detect(P3, P4, P5)

