# YOLOv12-MPSA-Hybrid 🚀, AGPL-3.0 license
# YOLOv12 dengan kombinasi MPSA standalone dan A2C2fMPSA
# Hybrid approach: MPSA untuk critical points, A2C2fMPSA untuk backbone/neck blocks
# Best for: Balanced performance dengan enhanced small object detection
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone dengan hybrid MPSA
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2fMPSA,  [512, True, 4]] # 6 A2C2fMPSA: Enhanced dengan MPSA
  - [-1, 1, MPSA,  [512]] # 7 MPSA: Additional attention refinement di P4
  - [-1, 1, Conv,  [1024, 3, 2]] # 8-P5/32
  - [-1, 4, A2C2fMPSA,  [1024, True, 1]] # 9 A2C2fMPSA: Enhanced dengan MPSA
  - [-1, 1, MPSA,  [1024]] # 10 MPSA: Additional attention refinement di P5

# YOLO12-turbo head dengan hybrid MPSA
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2fMPSA, [512, False, -1]] # 13 A2C2fMPSA di P4 neck
  - [-1, 1, MPSA,  [512]] # 14 MPSA: Final refinement di P4 neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2fMPSA, [256, False, -1]] # 17 A2C2fMPSA di P3 neck
  - [-1, 1, MPSA,  [256]] # 18 MPSA: Final refinement di P3 neck (critical untuk small objects)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2fMPSA, [512, False, -1]] # 21 A2C2fMPSA di P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 24 (P5/32-large)

  - [[17, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5) dengan hybrid MPSA-enhanced features

