# YOLOv12-ECA-Neck 🚀, AGPL-3.0 license
# YOLOv12 with ECA (Efficient Channel Attention) only in Neck
# Lightweight channel attention untuk feature fusion
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head with ECA in Neck
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, ECA,   [512]] # 12 ECA: Efficient Channel Attention di P4 neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15
  - [-1, 1, ECA,   [256]] # 16 ECA: Efficient Channel Attention di P3 neck

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 11], 1, Concat, [1]] # 18 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 19
  - [-1, 1, ECA,   [512]] # 20 ECA: Efficient Channel Attention di P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 8], 1, Concat, [1]] # 22 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)
  - [-1, 1, ECA,   [1024]] # 24 ECA: Efficient Channel Attention di P5 bottom-up

  # ECA final refinement di output layer sebelum Detect
  - [16, 1, ECA,   [256]] # 25 ECA: Final attention refinement di P3 output
  - [20, 1, ECA,   [512]] # 26 ECA: Final attention refinement di P4 output
  - [24, 1, ECA,   [1024]] # 27 ECA: Final attention refinement di P5 output

  - [[25, 26, 27], 1, Detect, [nc]] # Detect(P3, P4, P5) dengan ECA-enhanced features untuk deteksi

