# YOLOv12-C3k2Attn-ASSN 🚀, AGPL-3.0 license
# YOLOv12 dengan C3k2Attn di Backbone dan ASSN di Neck
# C3k2Attn = C3k2 + ECA attention untuk enhanced feature extraction di backbone
# ASSN = Attention-based Scale Sequence Network untuk feature refinement di neck
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone dengan C3k2Attn
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2Attn,  [256, False, 0.25]] # 2 - C3k2 dengan ECA attention
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2Attn,  [512, False, 0.25]] # 4 - C3k2 dengan ECA attention
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head with ASSN in Neck
head:
  # Top-down path: P5 → P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11 P4 processed

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14 P3A processed

  # ASSN: Attention-based Scale Sequence Network
  # Takes [P5, P4, P3A] and produces refined P3B
  - [[8, 11, 14], 2, ASSN, [1024, 512, 256, 256]] # 15 ASSN: P3B refined with attention

  # Bottom-up path: P3 → P4 → P5
  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 11], 1, Concat, [1]] # 17 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 18 P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]] # 19
  - [[-1, 8], 1, Concat, [1]] # 20 cat head P5
  - [-1, 2, C3k2Attn, [1024, True]] # 21 P5 bottom-up dengan C3k2Attn

  # Final outputs for detection
  - [15, 1, Conv, [256, 3, 1]] # 22 P3 final
  - [18, 1, Conv, [512, 3, 1]] # 23 P4 final
  - [21, 1, Conv, [1024, 3, 1]] # 24 P5 final

  - [[22, 23, 24], 1, Detect, [nc]] # Detect(P3, P4, P5) dengan C3k2Attn + ASSN-enhanced features

# Catatan penggunaan:
# ============================================
# C3k2Attn Format: [from, repeats, C3k2Attn, [c2, c3k, e]]
#   - c2: output channels (int)
#   - c3k: use C3k blocks instead of Bottleneck (bool, default: False)
#   - e: expansion ratio (float, default: 0.5)
#   - C3k2Attn otomatis menggunakan ECA attention (hardcoded)
#
# ASSN Format: [from, repeats, ASSN, [c_p5, c_p4, c_p3, c_out]]
#   - c_p5: P5 channels (int)
#   - c_p4: P4 channels (int)
#   - c_p3: P3 channels (int)
#   - c_out: output channels (int, default: same as c_p3)
#   - ASSN menerima 3 input: [P5, P4, P3A]
# ============================================
#
# Keuntungan kombinasi C3k2Attn + ASSN:
# 1. C3k2Attn di backbone: Enhanced feature extraction dengan ECA attention
# 2. ASSN di neck: Attention-based scale sequence fusion untuk better multi-scale features
# 3. Better small object detection dengan dual attention mechanism
# 4. Improved feature representation learning
# ============================================

