# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-NR-CNN: Noise-Robust CNN untuk Noisy Images
# 
# Strategi berdasarkan NR-CNN paper:
# - NoiseMapLayer: Deteksi noise dan generate noise map (optional, bisa skip)
# - AdaptiveConv2d: Drop noisy connections di early backbone dan neck
# - Adaptive pooling bisa ditambahkan jika diperlukan
#
# Expected: Better performance pada noisy images, damaged images, packet loss
# Focus: Robust terhadap berbagai jenis noise tanpa preprocessing

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone dengan AdaptiveConv2d untuk noise robustness
backbone:
  # [from, repeats, module, args]
  # Optional: NoiseMapLayer di awal (uncomment jika perlu noise detection)
  # - [-1, 1, NoiseMapLayer, ['simple']] # Generate noise map (tambah 1 channel)
  
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, AdaptiveConv2d, [128, 3, 2, None, 1, True]] # 1-P2/4: AdaptiveConv untuk noisy input
  # Args: [c2, k, s, p, g, act] = [128, 3, 2, None, 1, True]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, AdaptiveConv2d, [256, 3, 2, None, 1, True]] # 3-P3/8: AdaptiveConv
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 dengan attention
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-P5 dengan attention

# YOLO12-turbo head dengan AdaptiveConv2d untuk noise suppression saat fusion
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 1, AdaptiveConv2d, [512, 3, 1, None, 1, True]] # 11 AdaptiveConv di P4 neck (noise suppression)
  - [-1, 2, A2C2f, [512, False, -1]] # 12 P4 refine

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15 P3 refine

  # Bottom-up path (PAN)
  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 12], 1, Concat, [1]] # 17 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 18 P4 refine

  - [-1, 1, Conv, [512, 3, 2]] # 19
  - [[-1, 8], 1, Concat, [1]] # 20 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)

