# YOLOv12 Improved 🚀, AGPL-3.0 license
# Improved version with attention mechanisms and better feature fusion
# Untuk improve mAP dengan attention di head

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9 - Tambah SPPF untuk multi-scale features

# YOLO12-turbo head (dengan attention)
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 12
  - [-1, 1, ChannelAttention, [512]] # 13 - Tambah CA untuk P4
  - [-1, 1, SpatialAttention, [7]] # 14 - Tambah SA untuk P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 17
  - [-1, 1, ChannelAttention, [256]] # 18 - Tambah CA untuk P3
  - [-1, 1, SpatialAttention, [7]] # 19 - Tambah SA untuk P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [[-1, 1], 1, Concat, [1]] # 21 cat backbone P2
  - [-1, 2, A2C2f, [128, False, -1]] # 22
  - [-1, 1, ChannelAttention, [128]] # 23 - Tambah CA untuk P2 (small objects)
  - [-1, 1, SpatialAttention, [7]] # 24 - Tambah SA untuk P2

  # Bottom-up path (PAN)
  - [-1, 1, SPDConv, [128, 3, 2]] # 25 - Gunakan SPDConv untuk downsample (lebih baik untuk small objects)
  - [[-1, 17], 1, Concat, [1]] # 26 cat head P3 (layer 17 adalah P3 head)
  - [-1, 2, A2C2f, [256, False, -1]] # 27
  - [-1, 1, ChannelAttention, [256]] # 28
  - [-1, 1, SpatialAttention, [7]] # 29

  - [-1, 1, SPDConv, [256, 3, 2]] # 30 - SPDConv untuk downsample
  - [[-1, 14], 1, Concat, [1]] # 31 cat head P4
  - [-1, 2, C3k2, [512, False]] # 32
  - [-1, 1, ChannelAttention, [512]] # 33
  - [-1, 1, SpatialAttention, [7]] # 34

  # Detect
  - [[24, 29, 34], 1, Detect, [nc]] # 35 Detect(P2, P3, P4)

