# YOLOv12-P2P3P4-Optimal 🚀, AGPL-3.0 license
# Optimal configuration untuk Small Object Detection (BTA)
# 
# ✅ Key Principles:
# 1. Output Scale: P2 + P3 + P4 (❌ NO P5 - noise untuk objek kecil)
# 2. Backbone: Clean & Tajam (Conv + C3k2 + SPDConv sekali, NO attention di backbone)
# 3. Attention TARUH DI NECK setelah concat (A2C2f untuk feature selection)
#
# Kenapa P2+P3+P4?
# - mAP50 sensitif ke recall
# - P2 = spatial detail ↑ (resolusi tertinggi untuk small objects)
# - P5 sering nambah noise untuk objek kecil (kayak BTA)
# - P5 lebih bantu mAP50-95, bukan mAP50
#
# Kenapa Backbone Clean?
# - Backbone = ekstraksi, bukan mikir
# - Terlalu banyak attention di backbone → feature jadi blur
# - Best combo: Conv + C3k2 (light, spatial aware) + SPDConv (sekali aja)
#
# Kenapa Attention di NECK?
# - mAP50 naik karena feature selection lebih bersih
# - Noise suppression di level semantic (bukan low-level)
# - A2C2f = area + channel attention, cocok untuk:
#   * Background kotor
#   * Objek kecil
#   * Tekstur mirip noise
#
# Expected: Better recall untuk small objects → mAP50 naik

# Parameters
nc: 1 # number of classes (single class detection)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 497 layers, 2,553,904 parameters, 2,553,888 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 533 layers, 19,670,784 parameters, 19,670,768 gradients, 60.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 895 layers, 26,506,496 parameters, 26,506,480 gradients, 83.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 895 layers, 59,414,176 parameters, 59,414,160 gradients, 185.9 GFLOPs

# ✅ YOLO12-turbo backbone: CLEAN & TAJAM (NO attention di backbone!)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2-P2 backbone output (C3k2: light, spatial aware)
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4-P3 backbone output
  - [-1, 1, SPDConv, [512, 3, 2]] # 5-P4/16 (SPDConv SEKALI AJA - preserve spatial info)
  - [-1, 2, C3k2,  [512, False, 0.25]] # 6-P4 backbone output
  # ❌ NO P5 - tidak perlu, nambah noise untuk objek kecil

# ✅ YOLO12-turbo head: Attention DI NECK (setelah concat FPN/PAN)
head:
  # Top-down path (FPN)
  # P4 → P3 (FPN: dari P4 backbone ke P3)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 7-Upsample P4 to P3 size
  - [[-1, 4], 1, Concat, [1]] # 8-Concat P4_upsampled (layer 7) + P3_backbone (layer 4)
  - [-1, 2, A2C2f, [256, False, -1]] # 9-P3 neck (A2C2f DI NECK: feature selection setelah concat)
  - [-1, 1, Conv, [256, 3, 1]] # 10-P3 refine (Conv untuk finalize)

  # P3 → P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11-Upsample P3 to P2 size
  - [[-1, 2], 1, Concat, [1]] # 12-Concat P3_upsampled + P2_backbone (layer 2)
  - [-1, 2, A2C2f, [128, False, -1]] # 13-P2 neck (A2C2f DI NECK: feature selection untuk P2)
  - [-1, 1, Conv, [128, 3, 1]] # 14-P2 refine (Conv untuk finalize)

  # Bottom-up path (PAN)
  # P2 → P3
  - [-1, 1, Conv, [128, 3, 2]] # 15-Downsample P2 to P3 size
  - [[-1, 10], 1, Concat, [1]] # 16-Concat P2_downsampled + P3_neck (layer 10)
  - [-1, 2, A2C2f, [256, False, -1]] # 17-P3 final (A2C2f DI NECK: noise suppression)
  - [-1, 1, Conv, [256, 3, 1]] # 18-P3 final refine

  # P3 → P4
  - [-1, 1, Conv, [256, 3, 2]] # 19-Downsample P3 to P4 size
  - [[-1, 6], 1, Concat, [1]] # 20-Concat P3_downsampled + P4_backbone (layer 6)
  - [-1, 2, A2C2f, [512, False, -1]] # 21-P4 final (A2C2f DI NECK: feature selection)
  - [-1, 1, Conv, [512, 3, 1]] # 22-P4 final refine

  # ✅ Detect: P2 + P3 + P4 (NO P5!)
  - [[14, 18, 22], 1, Detect, [nc]] # 23-Detect(P2, P3, P4)

