# Ultralytics ðŸš€ AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-SFAN-Optimized: Kombinasi Top Performers yang SUDAH TERBUKTI
# 
# âš ï¸ CATATAN: Versi ini menggunakan modul yang SUDAH ADA dan TERBUKTI bagus
# Kombinasi berdasarkan hasil testing:
# - FBSB: mAP50-95 = 0.444 (TERBAIK)
# - SOE: mAP50 = 0.87, mAP50-95 = 0.437 (bagus untuk small objects)
# - SPDConv: Preserve small object info (sudah ada di yolov12.yaml)
# - DeformableHead: mAP50 = 0.872, mAP50-95 = 0.44 (bagus)
#
# Filosofi SFAN tetap: Suppress noise di P4/P5, amplify signal untuk small objects
# Tapi pakai modul yang SUDAH TERBUKTI performa-nya!

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 output
  # Noise Suppression: Pakai FBSB (TERBAIK mAP50-95: 0.444) - separate foreground/background
  - [-1, 1, FBSB, [512]] # 7-FBSB: Noise suppression via foreground-background separation
  
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 9-P5 output
  # Noise Suppression: Pakai FBSB
  - [-1, 1, FBSB, [1024]] # 10-FBSB: Noise suppression

# YOLOv12-SFAN-Optimized head (P4-P5 focus, tapi keep P3 untuk reference)
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11-Upsample P5 to P4 size
  - [[-1, 7], 1, Concat, [1]] # 12-Concat P5_upsampled (layer 11) + P4_FBSB (layer 7)
  - [-1, 2, A2C2f, [512, False, -1]] # 13-P4 neck output
  # Small Object Enhancement: Pakai SOE (mAP50: 0.87, mAP50-95: 0.437)
  - [-1, 1, SOE, [512]] # 14-SOE: Small object enhancement (proven result: 0.87 mAP50)
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15-Upsample to P3 size
  - [[-1, 4], 1, Concat, [1]] # 16-Concat dengan backbone P3 (layer 4)
  - [-1, 2, A2C2f, [256, False, -1]] # 17-P3 neck output
  - [-1, 1, FBSB, [256]] # 18-FBSB: Best mAP50-95 (0.444) untuk P3
  
  # Bottom-up path (PAN) - SPDConv untuk preserve small objects
  - [-1, 1, SPDConv, [256, 3, 2]] # 19-SPDConv: Preserve small object info (P3->P4)
  - [[-1, 14], 1, Concat, [1]] # 20-Concat P3_neck_downsampled (layer 19) + P4_SOE (layer 14)
  - [-1, 2, A2C2f, [512, False, -1]] # 21-P4 final output
  - [-1, 1, DeformableHead, [512]] # 22-DeformableHead: mAP50 = 0.872, mAP50-95 = 0.44
  
  - [-1, 1, SPDConv, [512, 3, 2]] # 23-SPDConv: Preserve small object info (P4->P5)
  - [[-1, 10], 1, Concat, [1]] # 24-Concat P4_final_downsampled (layer 23) + P5_FBSB (layer 10)
  - [-1, 2, C3k2, [1024, True]] # 25-P5 final output
  - [-1, 1, DeformableHead, [1024]] # 26-DeformableHead: mAP50 = 0.872, mAP50-95 = 0.44
  
  # Detection Heads
  - [[18, 22, 26], 1, Detect, [nc]] # 27-Detect(P3, P4, P5)

