# YOLOv12-ECAP 🚀, AGPL-3.0 license
# YOLOv12 dengan ECAP techniques dari paper ECAP-YOLOv5
# Features:
# 1. Transposed Convolution untuk upsampling (better untuk small objects)
# 2. EAC34 blocks di backbone (best mAP: EAC34)
# 3. MEAP di neck (best performance: MEAP)
# 4. Extra detect layer untuk very small objects (P2/4)
# Hati-hati OOM: Menggunakan teknik yang lebih efisien
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone dengan EAC34 (best mAP)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 1, EAC34, [256, 1, True]] # 2 EAC34: ECA between conv in bottleneck
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 1, EAC34, [512, 1, True]] # 4 EAC34
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 1, EAC34, [512, 1, True]] # 6 EAC34
  - [-1, 1, MEAP,  [512, [5, 9, 13]]] # 7 MEAP: Max pooling ECA pyramid (best performance)
  - [-1, 1, Conv,  [1024, 3, 2]] # 8-P5/32
  - [-1, 1, EAC34, [1024, 1, True]] # 9 EAC34

# YOLO12-turbo head dengan Transposed Conv + MEAP + Extra Detect Layer
head:
  # Top-down path: P5 → P4 → P3 → P2 (untuk very small objects)
  # Using Transposed Convolution instead of nearest neighbor upsampling
  - [-1, 1, ConvTranspose, [512, 2, 2]] # 10 Transposed Conv: P5→P4 (learnable upsampling)
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 1, EAC34, [512, 1, True]] # 12 EAC34 refinement
  - [-1, 1, MEAP,  [512, [5, 9, 13]]] # 13 MEAP: Multi-scale attention

  - [-1, 1, ConvTranspose, [256, 2, 2]] # 14 Transposed Conv: P4→P3
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 1, EAC34, [256, 1, True]] # 16 EAC34 refinement
  - [-1, 1, MEAP,  [256, [5, 9, 13]]] # 17 MEAP: Multi-scale attention

  # Extra layer untuk very small objects (P2/4)
  - [-1, 1, ConvTranspose, [128, 2, 2]] # 18 Transposed Conv: P3→P2
  - [[-1, 1], 1, Concat, [1]] # 19 cat backbone P2
  - [-1, 1, EAC34, [128, 1, True]] # 20 EAC34 refinement
  - [-1, 1, MEAP,  [128, [5, 9, 13]]] # 21 MEAP: Multi-scale attention untuk very small objects

  # Bottom-up path: P2 → P3 → P4 → P5
  - [-1, 1, Conv, [128, 3, 2]] # 22 P2→P3
  - [[-1, 16], 1, Concat, [1]] # 23 cat head P3
  - [-1, 1, EAC34, [256, 1, True]] # 24 EAC34 refinement

  - [-1, 1, Conv, [256, 3, 2]] # 25 P3→P4
  - [[-1, 12], 1, Concat, [1]] # 26 cat head P4
  - [-1, 1, EAC34, [512, 1, True]] # 27 EAC34 refinement

  - [-1, 1, Conv, [512, 3, 2]] # 28 P4→P5
  - [[-1, 9], 1, Concat, [1]] # 29 cat head P5
  - [-1, 1, EAC34, [1024, 1, True]] # 30 EAC34 refinement

  # Final outputs untuk detection (4 layers: P2, P3, P4, P5)
  - [20, 1, Conv, [128, 3, 1]] # 31 P2 final (very small objects)
  - [24, 1, Conv, [256, 3, 1]] # 32 P3 final (small objects)
  - [27, 1, Conv, [512, 3, 1]] # 33 P4 final (medium objects)
  - [30, 1, Conv, [1024, 3, 1]] # 34 P5 final (large objects)

  # Detect dengan 4 layers untuk very small object detection
  - [[31, 32, 33, 34], 1, Detect, [nc]] # Detect(P2, P3, P4, P5) dengan ECAP-enhanced features

