# YOLOv12-P3P4-Strong 🚀, AGPL-3.0 license
# YOLOv12 dengan Strong Background Suppression di P3/P4 backbone dan Edge Enhancement di head
# Versi lebih kuat: multiple suppression stages + enhanced edge detection
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, AggressiveBackgroundSuppression, [512, 0.8]] # 5 ABS: Strong suppression (0.8) di P3 (c2=512, strength=0.8)
  - [-1, 1, Conv,  [512, 3, 2]] # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 7
  - [-1, 1, AggressiveBackgroundSuppression, [512, 0.8]] # 8 ABS: Strong suppression (0.8) di P4 (c2=512, strength=0.8)
  - [-1, 1, Conv,  [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10

# YOLO12-turbo head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 8], 1, Concat, [1]] # 12 cat backbone P4 (setelah ABS)
  - [-1, 2, A2C2f, [512, False, -1]] # 13
  - [-1, 1, MultiScaleEdgeEnhancement, [512, 2.5]] # 14 MSE: Edge enhancement di HeadP4 (c2=512, strength=2.5)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 5], 1, Concat, [1]] # 16 cat backbone P3 (setelah ABS)
  - [-1, 2, A2C2f, [256, False, -1]] # 17
  - [-1, 1, MultiScaleEdgeEnhancement, [256, 2.5]] # 18 MSE: Edge enhancement di HeadP3 (strong, c2=256, strength=2.5)
  - [-1, 1, AggressiveBackgroundSuppression, [256, 0.6]] # 19 ABS: Final suppression sebelum Detect P3 (c2=256, strength=0.6)

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 13], 1, Concat, [1]] # 21 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 22

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 10], 1, Concat, [1]] # 24 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)

