# YOLOv12-ECAP-Light 🚀, AGPL-3.0 license
# YOLOv12 dengan ECAP techniques (lightweight version untuk avoid OOM)
# Features:
# 1. Transposed Convolution untuk upsampling (hanya di key points)
# 2. EAC34 blocks di backbone (minimal usage)
# 3. MEAP hanya di critical points
# 4. Standard 3 detect layers (P3, P4, P5) - no extra layer untuk save memory
# Best for: Limited memory, tetap ingin improve mAP dengan ECAP techniques
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone dengan EAC34 (selective usage)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 1, EAC34, [512, 1, True]] # 6 EAC34: ECA between conv in bottleneck
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 1, EAC34, [1024, 1, True]] # 8 EAC34

# YOLO12-turbo head dengan Transposed Conv + MEAP (lightweight)
head:
  # Top-down path: P5 → P4 → P3
  # Using Transposed Convolution untuk learnable upsampling
  - [-1, 1, ConvTranspose, [512, 2, 2]] # 9 Transposed Conv: P5→P4
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11 A2C2f refinement
  - [-1, 1, MEAP,  [512, [5, 9, 13]]] # 12 MEAP: Multi-scale attention (best performance)

  - [-1, 1, ConvTranspose, [256, 2, 2]] # 13 Transposed Conv: P4→P3
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 15 A2C2f refinement
  - [-1, 1, MEAP,  [256, [5, 9, 13]]] # 16 MEAP: Multi-scale attention

  # Bottom-up path: P3 → P4 → P5
  - [-1, 1, Conv, [256, 3, 2]] # 17 P3→P4
  - [[-1, 11], 1, Concat, [1]] # 18 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 19 A2C2f refinement

  - [-1, 1, Conv, [512, 3, 2]] # 20 P4→P5
  - [[-1, 8], 1, Concat, [1]] # 21 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 C3k2 refinement

  # Final outputs untuk detection (3 layers: P3, P4, P5)
  - [16, 1, Conv, [256, 3, 1]] # 23 P3 final
  - [19, 1, Conv, [512, 3, 1]] # 24 P4 final
  - [22, 1, Conv, [1024, 3, 1]] # 25 P5 final

  # Detect dengan 3 layers (standard, no extra layer untuk save memory)
  - [[23, 24, 25], 1, Detect, [nc]] # Detect(P3, P4, P5) dengan ECAP-enhanced features

