# YOLOv12-P3P4-Moderate 🚀, AGPL-3.0 license
# YOLOv12 dengan Moderate Background Suppression dan Edge Enhancement
# Versi lebih ringan dari aggressive - suppression/enhancement lebih halus
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, BackgroundSuppressionGate, [512, 7]] # 5 BSG: Moderate suppression di P3 (kernel=7, lebih halus)
  - [-1, 1, Conv,  [512, 3, 2]] # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 7
  - [-1, 1, BackgroundSuppressionGate, [512, 7]] # 8 BSG: Moderate suppression di P4 (kernel=7)
  - [-1, 1, Conv,  [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10

# YOLO12-turbo head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 8], 1, Concat, [1]] # 12 cat backbone P4 (setelah BSG)
  - [-1, 2, A2C2f, [512, False, -1]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 5], 1, Concat, [1]] # 15 cat backbone P3 (setelah BSG)
  - [-1, 2, A2C2f, [256, False, -1]] # 16
  - [-1, 1, EdgeLineEnhancement, [256, 4]] # 17 ELE: Edge enhancement di HeadP3 (reduction=4, lebih halus)
  
  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 13], 1, Concat, [1]] # 19 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 20

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 10], 1, Concat, [1]] # 22 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)

