# YOLOv12 dengan C3k2Attn Example 🚀, AGPL-3.0 license
# Contoh penggunaan C3k2Attn (C3k2 dengan ECA attention)
# C3k2Attn = C3k2 + LightAttention (ECA) untuk enhanced feature extraction

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone dengan C3k2Attn
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2Attn,  [256, False, 0.25]] # 2 - C3k2 dengan ECA attention
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2Attn,  [512, False, 0.25]] # 4 - C3k2 dengan ECA attention
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14

  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [[-1, 11], 1, Concat, [1]] # 16 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 17

  - [-1, 1, Conv, [512, 3, 2]] # 18
  - [[-1, 8], 1, Concat, [1]] # 19 cat head P5
  - [-1, 2, C3k2Attn, [1024, True]] # 20 - C3k2Attn di P5 (large scale)

  - [[14, 17, 20], 1, Detect, [nc]] # 21 Detect(P3, P4, P5)

# Catatan penggunaan C3k2Attn:
# Format: [from, repeats, C3k2Attn, [c2, c3k, e]]
#   - c2: output channels (int)
#   - c3k: use C3k blocks instead of Bottleneck (bool, default: False)
#   - e: expansion ratio (float, default: 0.5)
# 
# C3k2Attn otomatis menggunakan ECA attention (hardcoded)
# Tidak perlu pass attn_type parameter - akan di-ignore oleh parse_model







