# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLO12 Optimal: FBSB + SPDConv + DeformableHead
# Best mAP50-95: 0.444 (FBSB) + 0.44 (DeformableHead) + SPDConv untuk small objects

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12n head - Optimal: FBSB + SPDConv + DeformableHead
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11
  - [-1, 1, FBSB, [512]] # FBSB: Best mAP50-95 (0.444)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14
  - [-1, 1, FBSB, [256]] # FBSB untuk P3

  # Bottom-up path (PAN) - SPDConv untuk small object preservation
  - [-1, 1, SPDConv, [256, 3, 2]] # SPDConv preserve small object info (P3->P4)
  - [[-1, 12], 1, Concat, [1]] # cat head P4 (layer 12 = P4 setelah FBSB)
  - [-1, 2, A2C2f, [512, False, -1]] # 17
  - [-1, 1, DeformableHead, [512]] # DeformableHead: 0.872 mAP50, 0.44 mAP50-95

  - [-1, 1, SPDConv, [512, 3, 2]] # SPDConv untuk P4->P5
  - [[-1, 8], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 20 (P5/32-large)
  - [-1, 1, DeformableHead, [1024]] # DeformableHead untuk P5

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

