# YOLOv12-FBSB-SOE 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs combining:
# - FBSB (Foreground-Background Separation Block) - Best overall mAP50-95: 0.444
# - SOE (Small Object Enhancement Block) - Best balanced: mAP50-95: 0.437
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n-fbsb-soe.yaml' will call yolov12-fbsb-soe.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, SOE,   [256]] # 3 SOE Block: Small Object Enhancement at P2 level (mAP50-95: 0.437)
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 4-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 5
  - [-1, 1, Conv,  [512, 3, 2]] # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 7
  - [-1, 1, Conv,  [1024, 3, 2]] # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 9

# YOLO12-turbo head with FBSB Block
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 7], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [-1, 1, FBSB, [256]] # 14 FBSB Block: Foreground-Background Separation (mAP50-95: 0.444 - BEST)
  - [[-1, 5], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 16

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 12], 1, Concat, [1]] # 18 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 19

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 9], 1, Concat, [1]] # 21 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

