# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-mAP50-Boost-BiFPN: Dengan BiFPN (Weighted Fusion)
# 
# Improvement Strategy:
# 1. Backbone: Context Augmentation (Large Kernel Conv + Global Context Block)
# 2. Neck: BiFPN (Weighted Bi-directional Feature Pyramid) - Advanced
# 3. Head: DW-Decoupled Head (Depthwise Separable Decoupled)
#
# Note: BiFPN return list, jadi perlu handle dengan Index module atau manual extract
# Versi ini lebih advanced tapi perlu modifikasi tasks.py untuk handle list output

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone dengan Context Augmentation
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 output
  - [-1, 1, LargeKernelConv, [512, 512, 7, 1]] # 7-Large Kernel 7x7
  - [-1, 1, GlobalContextBlock, [512, 512, 4]] # 8-GC Block
  
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10-P5 output
  - [-1, 1, LargeKernelConv, [1024, 1024, 7, 1]] # 11-Large Kernel 7x7
  - [-1, 1, GlobalContextBlock, [1024, 1024, 4]] # 12-GC Block

# YOLOv12-mAP50-Boost-BiFPN head
head:
  # BiFPN: Weighted Bi-directional Feature Pyramid
  # Input: [P3, P4, P5] dari backbone (layers 4, 8, 12)
  - [[4, 8, 12], 1, BiFPN, [512]] # 13-BiFPN: Weighted fusion
  # Output: List [P3_enhanced, P4_enhanced, P5_enhanced]
  # Note: Perlu Index module untuk extract individual outputs
  
  # Extract P3 dari BiFPN output (index 0)
  - [13, 1, Index, [0]] # 14-P3 dari BiFPN
  - [-1, 2, A2C2f, [256, False, -1]] # 15-P3 refined
  
  # Extract P4 dari BiFPN output (index 1)
  - [13, 1, Index, [1]] # 16-P4 dari BiFPN
  - [-1, 2, A2C2f, [512, False, -1]] # 17-P4 refined
  
  # Extract P5 dari BiFPN output (index 2)
  - [13, 1, Index, [2]] # 18-P5 dari BiFPN
  - [-1, 2, A2C2f, [1024, False, -1]] # 19-P5 refined
  
  # Bottom-up path (PAN)
  - [15, 1, Conv, [256, 3, 2]] # 20-Downsample P3 to P4 size
  - [[-1, 17], 1, Concat, [1]] # 21-Concat P3_downsampled + P4_refined
  - [-1, 2, A2C2f, [512, False, -1]] # 22-P4 final
  
  - [-1, 1, Conv, [512, 3, 2]] # 23-Downsample P4 to P5 size
  - [[-1, 19], 1, Concat, [1]] # 24-Concat P4_downsampled + P5_refined
  - [-1, 2, C3k2, [1024, True]] # 25-P5 final
  
  # DW-Decoupled Head
  - [[15, 22, 25], 1, DWDecoupledHead, [nc]] # 26-DWDecoupledHead: Detect(P3, P4, P5)

