# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-mAP50-Boost: Maximum mAP50 Improvement
# 
# Improvement Strategy:
# 1. Backbone: Context Augmentation (Large Kernel Conv + Global Context Block)
# 2. Neck: Enhanced FPN dengan Large Kernel + Global Context
# 3. Head: DW-Decoupled Head (Depthwise Separable Decoupled)
#
# Expected: mAP50 boost ~1-2% dari baseline

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone dengan Context Augmentation
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 output
  # Context Augmentation: Large Kernel Conv untuk global context
  - [-1, 1, LargeKernelConv, [512, 512, 7, 1]] # 7-Large Kernel 7x7 untuk P4
  - [-1, 1, GlobalContextBlock, [512, 512, 4]] # 8-GC Block untuk global context
  
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10-P5 output
  # Context Augmentation: Large Kernel Conv untuk global context
  - [-1, 1, LargeKernelConv, [1024, 1024, 7, 1]] # 11-Large Kernel 7x7 untuk P5
  - [-1, 1, GlobalContextBlock, [1024, 1024, 4]] # 12-GC Block untuk global context
  
  # P6 Layer (Extra Scale untuk objek besar)
  - [-1, 1, Conv, [1024, 3, 2]] # 13-P6/64
  - [-1, 2, C3k2, [1024, True]] # 14-P6 output
  - [-1, 1, GlobalContextBlock, [1024, 1024, 4]] # 15-GC Block untuk P6

# YOLOv12-mAP50-Boost head dengan Enhanced FPN + DW-Decoupled Head
head:
  # Top-down path (FPN) dengan Large Kernel untuk context
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16-Upsample P6 to P5 size
  - [[-1, 12], 1, Concat, [1]] # 17-Concat P6_upsampled (layer 16) + P5_GC (layer 12)
  - [-1, 2, A2C2f, [1024, False, -1]] # 18-P5 neck
  - [-1, 1, LargeKernelConv, [1024, 1024, 7, 1]] # 19-Large Kernel untuk P5 neck
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20-Upsample P5 to P4 size
  - [[-1, 8], 1, Concat, [1]] # 21-Concat P5_neck (layer 20) + P4_GC (layer 8)
  - [-1, 2, A2C2f, [512, False, -1]] # 22-P4 neck
  - [-1, 1, LargeKernelConv, [512, 512, 7, 1]] # 23-Large Kernel untuk P4 neck
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 24-Upsample P4 to P3 size
  - [[-1, 4], 1, Concat, [1]] # 25-Concat P4_neck (layer 24) + P3_backbone (layer 4)
  - [-1, 2, A2C2f, [256, False, -1]] # 26-P3 neck
  - [-1, 1, GlobalContextBlock, [256, 256, 4]] # 27-GC Block untuk P3
  
  # Bottom-up path (PAN) dengan Large Kernel
  - [-1, 1, Conv, [256, 3, 2]] # 28-Downsample P3 to P4 size
  - [[-1, 23], 1, Concat, [1]] # 29-Concat P3_downsampled (layer 28) + P4_LK (layer 23)
  - [-1, 2, A2C2f, [512, False, -1]] # 30-P4 final
  - [-1, 1, GlobalContextBlock, [512, 512, 4]] # 31-GC Block untuk P4 final
  
  - [-1, 1, Conv, [512, 3, 2]] # 32-Downsample P4 to P5 size
  - [[-1, 19], 1, Concat, [1]] # 33-Concat P4_downsampled (layer 32) + P5_LK (layer 19)
  - [-1, 2, C3k2, [1024, True]] # 34-P5 final
  - [-1, 1, GlobalContextBlock, [1024, 1024, 4]] # 35-GC Block untuk P5 final
  
  - [-1, 1, Conv, [1024, 3, 2]] # 36-Downsample P5 to P6 size
  - [[-1, 15], 1, Concat, [1]] # 37-Concat P5_downsampled (layer 36) + P6_GC (layer 15)
  - [-1, 2, C3k2, [1024, True]] # 38-P6 final
  
  # DW-Decoupled Head: Depthwise Separable Decoupled untuk efisiensi + spesialisasi
  - [[27, 31, 35, 38], 1, DWDecoupledHead, [nc]] # 39-DWDecoupledHead: Detect(P3, P4, P5, P6)
