# YOLOv12-MPSA 🚀, AGPL-3.0 license
# YOLOv12 dengan MPSA (Multi-scale Pooling and Spatial Attention) Module
# MPSA combines multi-scale convolutions and three types of global pooling
# (average, max, and median pooling) for enhanced small object detection
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone dengan MPSA
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, MPSA,  [256]] # 2 MPSA: Multi-scale pooling and spatial attention di P2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f,  [512, True, 4]] # 7
  - [-1, 1, MPSA,  [512]] # 8 MPSA: Enhanced attention di P4
  - [-1, 1, Conv,  [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f,  [1024, True, 1]] # 10
  - [-1, 1, MPSA,  [1024]] # 11 MPSA: Enhanced attention di P5

# YOLO12-turbo head dengan MPSA
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 14
  - [-1, 1, MPSA,  [512]] # 15 MPSA: Enhanced attention di P4 neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 18
  - [-1, 1, MPSA,  [256]] # 19 MPSA: Enhanced attention di P3 neck

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 22
  - [-1, 1, MPSA,  [512]] # 23 MPSA: Enhanced attention di P4 bottom-up

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 26 (P5/32-large)

  - [[18, 22, 26], 1, Detect, [nc]] # Detect(P3, P4, P5) dengan MPSA-enhanced features

