# YOLOv12-IDE2: Shape Gate 🚀, AGPL-3.0 license
# IDE 2: Shape Consistency Gate untuk enhance edges/structure
# 
# Strategi:
# - Shape Gate @ HeadP3 (setelah P3 refine)
# - Enhance edges/structure untuk rod-like objects
# - Depthwise → fokus spatial (bukan channel)
# - CNN-friendly (tidak pakai Sobel eksplisit, stabil gradient)
# 
# Expected: Edge enhancement → Better rod detection → mAP50 naik

# Parameters
nc: 1 # number of classes (single class detection)
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 497 layers, 2,553,904 parameters, 2,553,888 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 533 layers, 19,670,784 parameters, 19,670,768 gradients, 60.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 895 layers, 26,506,496 parameters, 26,506,480 gradients, 83.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 895 layers, 59,414,176 parameters, 59,414,160 gradients, 185.9 GFLOPs
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone (clean)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4-P3 backbone output
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 output
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-P5 output

# YOLO12-turbo head with Shape Gate @ P3
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9-Upsample P5 to P4 size
  - [[-1, 6], 1, Concat, [1]] # 10-Concat P5_upsampled + P4_backbone
  - [-1, 2, A2C2f, [512, False, -1]] # 11-P4 neck

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12-Upsample P4 to P3 size
  - [[-1, 4], 1, Concat, [1]] # 13-Concat P4_neck + P3_backbone
  - [-1, 2, A2C2f, [256, False, -1]] # 14-P3 neck
  
  # ✅ IDE 2: Shape Gate @ HeadP3 (setelah P3 refine)
  # Enhance edges/structure for rod-like objects
  # Parameters: [c1] = [256]
  # Depthwise conv → fokus spatial (edge detection)
  # Pointwise conv → output projection
  - [-1, 1, ShapeGate, [256]] # 15-Shape Gate: Edge enhancement untuk rod objects

  # Bottom-up path (PAN)
  - [-1, 1, Conv, [256, 3, 2]] # 16-Downsample P3 to P4 size
  - [[-1, 11], 1, Concat, [1]] # 17-Concat P3_downsampled + P4_neck
  - [-1, 2, A2C2f, [512, False, -1]] # 18-P4 final

  - [-1, 1, Conv, [512, 3, 2]] # 19-Downsample P4 to P5 size
  - [[-1, 8], 1, Concat, [1]] # 20-Concat P4_downsampled + P5_backbone
  - [-1, 2, C3k2, [1024, True]] # 21-P5 final

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)

