# YOLOv12-Texture-Punish 🚀, AGPL-3.0 license
# Texture Punishment Architecture untuk suppress texture false positives
# 
# Strategi:
# 1. Local Contrast Gate @ P3 (suppress homogeneous texture)
# 2. Background Suppression Gate @ P3/P4 (punish background activations)
# 3. Shape Gate @ P3 (enhance edges untuk rod-like objects)
# 4. Architecture: P2+P3+P4 (no P5 - noise reduction)
#
# Konsep Texture Punishment:
# - Texture FP itu: Confident tapi salah (false positive)
# - Punishment di 2 level:
#   1. Feature Level: Suppression gates di neck (ini file YAML)
#   2. Loss Level: FP Confidence Dampener (lihat yolov12-ide3-fp-dampener.md)
#
# Expected: Texture suppression → False positive turun drastis → mAP50 naik
#
# Usage:
# - Combine dengan loss-side FP Dampener untuk maximum effect
# - Training: cls=1.0 (naikkan class loss) + texture_punish=True

# Parameters
nc: 1 # number of classes (single class detection)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 497 layers, 2,553,904 parameters, 2,553,888 gradients, 6.2 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 497 layers, 9,127,424 parameters, 9,127,408 gradients, 19.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 533 layers, 19,670,784 parameters, 19,670,768 gradients, 60.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 895 layers, 26,506,496 parameters, 26,506,480 gradients, 83.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 895 layers, 59,414,176 parameters, 59,414,160 gradients, 185.9 GFLOPs

# YOLO12-turbo backbone: CLEAN (NO attention di backbone!)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2-P2 backbone output
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4-P3 backbone output
  - [-1, 1, SPDConv, [512, 3, 2]] # 5-P4/16 (SPDConv: preserve spatial info)
  - [-1, 2, C3k2,  [512, False, 0.25]] # 6-P4 backbone output
  # ❌ NO P5 - nambah noise untuk objek kecil

# YOLO12-turbo head: Texture Punishment di NECK
head:
  # Top-down path (FPN)
  # P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 7-Upsample P4 to P3 size
  - [[-1, 4], 1, Concat, [1]] # 8-Concat P4_upsampled + P3_backbone
  - [-1, 2, A2C2f, [256, False, -1]] # 9-P3 neck (A2C2f DI NECK: feature selection)
  - [-1, 1, Conv, [256, 3, 1]] # 10-P3 refine
  
  # ✅ Texture Punishment Layer 1: Local Contrast Gate (suppress homogeneous texture)
  - [-1, 1, LocalContrastGate, [256, 5, 0.7]] # 11-LCG: Suppress texture homogen @P3
  
  # ✅ Texture Punishment Layer 2: Background Suppression Gate (punish background)
  - [-1, 1, BackgroundSuppressionGate, [256, 7]] # 12-BSG: Punish background @P3
  
  # ✅ Texture Punishment Layer 3: Shape Gate (enhance edges untuk rod-like objects)
  - [-1, 1, ShapeGate, [256]] # 13-SG: Enhance edges untuk rod objects

  # P3 → P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14-Upsample P3 to P2 size
  - [[-1, 2], 1, Concat, [1]] # 15-Concat P3_upsampled + P2_backbone
  - [-1, 2, A2C2f, [128, False, -1]] # 16-P2 neck
  - [-1, 1, Conv, [128, 3, 1]] # 17-P2 refine
  # P2 juga dapat texture punishment (optional, lebih ringan)
  - [-1, 1, LocalContrastGate, [128, 5, 0.6]] # 18-LCG @P2 (lebih ringan: alpha=0.6)

  # Bottom-up path (PAN)
  # P2 → P3
  - [-1, 1, Conv, [128, 3, 2]] # 19-Downsample P2 to P3 size
  - [[-1, 10], 1, Concat, [1]] # 20-Concat P2_downsampled + P3_neck (layer 10, sebelum punishment)
  - [-1, 2, A2C2f, [256, False, -1]] # 21-P3 final (A2C2f: noise suppression)
  # Re-apply texture punishment di bottom-up path juga
  - [-1, 1, BackgroundSuppressionGate, [256, 7]] # 22-BSG @P3 final (punish background lagi)
  - [-1, 1, Conv, [256, 3, 1]] # 23-P3 final refine

  # P3 → P4
  - [-1, 1, Conv, [256, 3, 2]] # 24-Downsample P3 to P4 size
  - [[-1, 6], 1, Concat, [1]] # 25-Concat P3_downsampled + P4_backbone
  - [-1, 2, A2C2f, [512, False, -1]] # 26-P4 neck
  # ✅ Texture Punishment @P4: Background Suppression (ringan)
  - [-1, 1, BackgroundSuppressionGate, [512, 7]] # 27-BSG: Punish background @P4 (ringan)
  - [-1, 1, Conv, [512, 3, 1]] # 28-P4 final refine

  # ✅ Detect: P2 + P3 + P4 (NO P5!)
  # P2 (layer 18 setelah punishment), P3 (layer 23 setelah bottom-up), P4 (layer 28)
  - [[18, 23, 28], 1, Detect, [nc]] # 29-Detect(P2, P3, P4)
