# YOLOv12-BSG-ELEB 🚀, AGPL-3.0 license
# YOLOv12 with Background Suppression Gate (anti-nukleus) and Edge/Line Enhancement Block
# BSG: Suppress large activations (cells/nucleus) so BTA can be read
# ELEB: Enhance small edges/lines (especially for small rods)
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, EdgeLineEnhancement, [512]] # 5 ELEB: Edge/Line Enhancement at P3 backbone
  - [-1, 1, BackgroundSuppressionGate, [512]] # 6 BSG: Background Suppression Gate at P3 output (before P4)
  - [-1, 1, Conv,  [512, 3, 2]] # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 8
  - [-1, 1, Conv,  [1024, 3, 2]] # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10

# YOLO12-turbo head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 8], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 6], 1, Concat, [1]] # 15 cat backbone P3 (after BSG)
  - [-1, 2, A2C2f, [256, False, -1]] # 16
  - [-1, 1, EdgeLineEnhancement, [256]] # 17 ELEB: Edge/Line Enhancement at HeadP3 (before Detect)
  - [-1, 1, BackgroundSuppressionGate, [256]] # 18 BSG: Background Suppression Gate in neck before Detect P3

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 13], 1, Concat, [1]] # 20 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 21

  - [-1, 1, Conv, [512, 3, 2]] # 22
  - [[-1, 10], 1, Concat, [1]] # 23 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)

