# YOLOv12-P3-COMBO 🚀, AGPL-3.0 license
# YOLOv12 with multiple P3 enhancements combined:
# - FPI: Feature Pyramid Injection
# - SPP3: Spatial Pyramid Pooling
# - OCS: Object-Context Separation
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]] # 4
  - [-1, 1, Conv,  [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, Conv,  [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12-turbo head with multiple P3 enhancements
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13 cat backbone P3
  
  # FPI Block: Feature Pyramid Injection
  - [[4, 11, 8], 1, FPI, [256]] # 14 FPI: Inject P4/P5 features into P3
  
  # SPP3 Block: Spatial Pyramid Pooling
  - [-1, 1, SPP3, [256]] # 15 SPP3: Multi-scale context aggregation
  
  # OCS Block: Object-Context Separation
  - [-1, 1, OCS, [256, 7]] # 16 OCS: Separate object and context features
  
  - [-1, 2, A2C2f, [256, False, -1]] # 17

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 11], 1, Concat, [1]] # 19 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 20

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 8], 1, Concat, [1]] # 22 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)

