# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12-Dendritic: Dendritic Convolution untuk Noise Suppression & Small Object Detection
# 
# Strategi:
# - DendriticConv2d di backbone early (P1/P2) untuk noisy input suppression
# - DendriticConv2d di neck (FPN) untuk noise suppression saat fusion
# - Tetap maintain attention di P4/P5 backbone
# - Spatial + Channel Attention tetap ada untuk refinement
#
# Expected: Better noise handling, improved small object detection
# Focus: Multi-branch gating untuk adaptive feature selection

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12-turbo backbone dengan DendriticConv2d di early layers
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, DendriticConv2d, [128, 3, 2, None, 1, 1, 4]] # 1-P2/4: DendriticConv untuk noisy input (4 branches)
  # Args: [c2, k, s, p, g, branches] = [128, 3, 2, None, 1, 4]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4 dengan attention
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-P5 dengan attention

# YOLO12-turbo head dengan DendriticConv2d di neck untuk noise suppression
head:
  # Top-down path (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 1, SpatialAttention, [7]] # 11 Spatial attention setelah Concat P4
  - [-1, 1, DendriticConv2d, [512, 3, 1, None, 1, 1, 4]] # 12 DendriticConv di P4 neck (noise suppression saat fusion)
  # Args: [c2, k, s, p, g, branches] = [512, 3, 1, None, 1, 4]
  - [-1, 2, A2C2f, [512, False, -1]] # 13 P4 refine

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 1, SpatialAttention, [7]] # 16 Spatial attention setelah Concat P3
  - [-1, 2, A2C2f, [256, False, -1]] # 17 P3 refine
  - [-1, 1, ChannelAttention, [256]] # 18 Channel attention di P3 refine

  # Bottom-up path (PAN)
  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 13], 1, Concat, [1]] # 20 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 21 P4 refine
  - [-1, 1, ChannelAttention, [512]] # 22 Channel attention di P4 refine

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 8], 1, Concat, [1]] # 24 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 25 (P5/32-large)

  - [[18, 22, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)

